# 1. Задача: Створіть дві змінні first=10, second=30. Виведіть на екран результат математичної взаємодії (+, -, *, / и тд.) для цих чисел.
first = 10
second = 30
print(first + second)
print(first - second)
print(first * second)
print(first / second)
print(first ** second)
print(first // second)
print(first % second)

# 2. Задача: Створіть змінну и по черзі запишіть в неї результат порівняння (<, > , ==, !=) чисел з завдання 1. Виведіть на екран результат кожного порівняння.
spawn_value = first == second
print(spawn_value)
spawn_value = first < second
print(spawn_value)
spawn_value = first > second
print(spawn_value)
spawn_value = first != second
print(spawn_value)