'''
Hапишіть программу "Касир в кінотеатрі", яка буде виконувати наступне:
Попросіть користувача ввести свсвій вік.
- якщо користувачу менше 7 - вивести "Тобі ж <>! Де твої батьки?"
- якщо користувачу менше 16 - вивести "Тобі лише <>, а це е фільм для дорослих!"
- якщо користувачу більше 65 - вивести "Вам <>? Покажіть пенсійне посвідчення!"
- якщо вік користувача містить 7 - вивести "Вам <>, вам пощастить"
- у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <>, білетів всеодно нема!"
Замість <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік
Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача (1 - рік, 22 - роки, 35 - років і тд...).
Наприклад :
"Тобі ж 5 років! Де твої батьки?"
"Вам 81 рік? Покажіть пенсійне посвідчення!"
"Незважаючи на те, що вам 42 роки, білетів всеодно нема!"
Зробіть все за допомогою функцій! Не забувайте що кожна функція має виконувати тільки одне завдання і про правила написання коду.
'''


def word_form(years):
    years_forms = ('рік', 'років', 'роки')
    if years % 100 in (11, 12, 13, 14):
        return years_forms[1]
    elif years % 10 == 1:
        return years_forms[0]
    elif years % 10 in (2, 3, 4):
        return years_forms[2]
    else:
        return years_forms[1]


def cashier_answers(years, years_forms):
    if '7' in str(years):
        print(f'Вам {years} {years_forms}, вам пощастить')
    elif years < 7:
        print(f'Тобі ж {years} {years_forms}! Де твої батьки?')
    elif years < 16:
        print(f'Тобі лише {years} {years_forms}, а це е фільм для дорослих!')
    elif years > 65:
        print(f'Вам {years} {years_forms}? Покажіть пенсійне посвідчення!')
    else:
        print(f'Незважаючи на те, що вам {years} {years_forms}, білетів всеодно нема!')


def cinema_cashier():
    age_request = input('Вкажіть ваш вік цифрою\n')
    if age_request.isdigit() and int(age_request) > 0:
        age_request = int(age_request)
        form_age = word_form(years=age_request)
        cashier_answers(years=age_request, years_forms=form_age)
    else:
        print(f'Ви впевнені, що "{age_request}", це Ваш вік? Подумайте та вкажіть вірний вік цифрою')


cinema_cashier()
